# StairsRailingBalusterWidth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRailingBalusterWidth Property
ParameterTypeId Class See Also
---
"Baluster Width"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRailingBalusterWidth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRailingBalusterWidth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRailingBalusterWidth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace